{
  "categories": {
        "Général": {
        "description": "Commandes de base pour vérifier que le bot fonctionne et accéder à l'aide.",
        "commands": {
            "ping": "Teste si le bot répond correctement.",
            "help": "Affiche le menu d'aide interactif avec les commandes que tu peux utiliser.",
            "version": "Affiche la version actuelle du bot."
            }
        },

        "Duels": {
        "description": "Défie un autre membre et mise de l'XP (si le système XP est activé).",
        "commands": {
            "duel": "Lance un duel contre un membre avec une mise d'XP."
            } 
        },

        "Système XP": {
        "description": "Système d'expérience basé sur l'activité, avec niveaux, rôles et classement.",
        "commands": {
            "xp profile": "Affiche ton niveau, ton XP et ta progression.",
            "xp roles": "Affiche les rôles de niveau et l'XP nécessaire pour les obtenir.",
            "xp leaderboard": "Affiche le classement des membres selon leur XP.",
            "xp status": "Affiche l'état actuel du système XP.",
            "xp_admin": "(Staff) Ouvre le panneau de configuration du système XP.",
            "xp_modify": "(Staff) Ajoute ou retire de l'XP à un membre."
            }
        },

        "Vocaux temporaires": {
        "description": "Gestion automatique de salons vocaux temporaires.",
        "commands": {
            "tempvoice config": "(Staff) Configure le salon vocal parent servant à créer des vocaux temporaires.",
            "tempvoice list": "(Staff) Affiche la liste des salons configurés pour la création automatique."
            }
        },

        "Reaction roles": {
        "description": "Attribution automatique de rôles via des réactions sur des messages.",
        "commands": {
            "reactionrole add": "(Staff) Associe une réaction sur un message à un rôle.",
            "reactionrole remove": "(Staff) Supprime un rôle-réaction spécifique.",
            "reactionrole clear": "(Staff) Supprime toutes les réactions configurées sur un message.",
            "reactionrole list": "(Staff) Affiche la liste des rôles attribués par réaction."
            }
        },

        "Secret roles": {
        "description": "Gestion de rôles attribués via un message secret.",
        "commands": {
            "secretrole add": "(Staff) Configure un rôle attribué via un mot secret.",
            "secretrole remove": "(Staff) Supprime une configuration de rôle secret.",
            "secretrole list": "(Staff) Affiche la liste des rôles secrets configurés."
            }
        },

        "Message d'arrivée": {
        "description": "Configuration du message envoyé lorsqu'un nouveau membre rejoint le serveur.",
        "commands": {
            "welcome": "(Staff) Ouvre un panneau interactif pour configurer le message de bienvenue."
            }
        },

        "Autres": {
        "description": "Commandes diverses ne correspondant pas à une catégorie spécifique.",
        "commands": {}
        }
    }
}