{
    "ping" : "Cette commande permet de vérifier que le bot est bien en état de marche.",
    "add_reaction_role" : "Cette commande permet d'associer une réaction sur un message défini à un rôle.",
    "remove_specific_reaction" : "Cette commande permet de retirer une réaction spécifique d'un message, et donc l'attribution d'un rôle.",
    "remove_all_reactions" : "Cette commande permet de retirer toutes les réaction d'un message, et donc l'attribution de roles liés aux réactions supprimées.",
    "list_of_reaction_roles" : "Cette commande permet de lister des tous les rôles attribués avec une réaction à un message.",
    "add_secret_role" : "Cette commande permet d'attribuer un role défini si l'utilisateur entre le bon message dans le bon channel.",
    "delete_secret_role" : "Cette commande permet de supprimer l'attibution d'un secret_role déjà paramétré.",
    "list_of_secret_roles" : "Cette commande permet de lister des tous les rôles attribués avec un message secret.",
    "init_creation_voice_channel" : "Cette commande permet de définir le salon qui permettra à chacun de créer son propre salon vocal temporaire.",
    "remove_creation_voice_channel": "Cette commande désactive la création automatique de salons vocaux temporaires pour un salon donné.",
    "list_creation_voice_channels": "Cette commande affiche la liste des salons parents qui créent des vocaux temporaires.",
    "xp_enable": "Cette commande active le système d'XP sur ce serveur.",
    "xp_disable": "Cette commande désactive le système d'XP sur ce serveur.",
    "xp_status": "Cette commande affiche l'état du système d'XP sur ce serveur.",
    "xp": "Cette commande affiche ton XP et ton niveau.",
    "xp_list": "Cette commande liste les XP des membres (classement).",
    "xp_roles": "Cette commande affiche la liste des rôles de niveaux et l'XP requis pour atteindre chacun d'eux.",
    "xp_set_level": "Cette commande permet de définir l'XP requis pour un niveau.",
    "xp_set_config": "Cette commande permet de configurer le gain d'XP par message et le cooldown.",
    "xp_set_bonus": "Cette commande permet de définir le bonus d'XP appliqué si le membre affiche le tag du serveur sur son profil.",
    "xp_modify": "Cette commande ajoute/retire des XP à un membre."
}